Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	modMessagePostToMachine(the, NULL, 0, bleClientReadyEvent, NULL);
}

void xs_ble_client_close(xsMachine *the)
{
	modBLE ble = xsmcGetHostData(xsThis);
	if (!ble) return;

	gBLE = NULL;
	xsForget(ble->obj);
	xsmcSetHostData(xsThis, NULL);
	modMessagePostToMachine(ble->the, NULL, 0, bleClientCloseEvent, ble);
}

void xs_ble_client_destructor(void *data)
{
	modBLE ble = data;
	if (!ble) return;
	
	c_free(ble);
	gBLE = NULL;

	nrf_sdh_disable_request();
}

void xs_ble_client_set_local_privacy(xsMachine *the)
{
}

void xs_ble_client_start_scanning(xsMachine *the)
{
	ret_code_t err_code;
	uint8_t active = xsmcToBoolean(xsArg(0));
	uint16_t interval = xsmcToInteger(xsArg(1));
	uint16_t window = xsmcToInteger(xsArg(2));
	ble_gap_scan_params_t *scan_params = &gBLE->scan_params;
	nrf_ble_scan_init_t scan_init;

	c_memset(scan_params, 0, sizeof(ble_gap_scan_params_t));
	scan_params->active = active;
	scan_params->filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
	scan_params->interval = interval;
	scan_params->window = window;

    c_memset(&scan_init, 0, sizeof(scan_init));
    scan_init.p_scan_param = scan_params;

    err_code = nrf_ble_scan_init(&m_scan, &scan_init, NULL);
    if (NRF_SUCCESS == err_code)
    	err_code = nrf_ble_scan_start(&m_scan);
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble start scan failed");
}

void xs_ble_client_stop_scanning(xsMachine *the)
{
	nrf_ble_scan_stop();
}

void xs_ble_client_connect(xsMachine *the)
{
	uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint8_t addressType = xsmcToInteger(xsArg(1));
	ble_gap_addr_t addr;
	ret_code_t err_code;

	addr.addr_id_peer = 0;
	addr.addr_type = addressType;
	c_memmove(&addr.addr, address, BLE_GAP_ADDR_LEN);
		
	// Ignore duplicate connection attempts
	if (modBLEConnectionFindByAddress(&addr)) {
		LOG_GATTC_MSG("Ignoring duplicate connect attempt");
		return;
	};
	
	// Add a new connection record to be filled as the connection completes
	modBLEConnection connection = c_calloc(sizeof(modBLEConnectionRecord), 1);
	if (!connection)
		xsUnknownError("out of memory");
	connection->conn_handle = BLE_CONN_HANDLE_INVALID;
	connection->addr = addr;
	modBLEConnectionAdd(connection);
	
	err_code = sd_ble_gap_connect(&addr, &m_scan.scan_params, &m_scan.conn_params, APP_BLE_CONN_CFG_TAG);
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble connect failed");
}

void xs_ble_client_set_security_parameters(xsMachine *the)
{
	uint8_t encryption = xsmcToBoolean(xsArg(0));
	uint8_t bonding = xsmcToBoolean(xsArg(1));
	uint8_t mitm = xsmcToBoolean(xsArg(2));
	uint16_t ioCapability = xsmcToInteger(xsArg(3));
	
	gBLE->encryption = encryption;
	gBLE->bonding = bonding;
	gBLE->mitm = mitm;

	modBLESetSecurityParameters(encryption, bonding, mitm, ioCapability);
}

void xs_ble_client_passkey_reply(xsMachine *the)
{
	uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint8_t confirm = xsmcToBoolean(xsArg(1));
}

void xs_gap_connection_initialize(xsMachine *the)
{
	uint8_t conn_id;
	xsmcVars(1);	// xsArg(0) is client
	xsmcGet(xsVar(0), xsArg(0), xsID_connection);
	conn_id = xsmcToInteger(xsVar(0));
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_id);
	if (!connection)
		xsUnknownError("connection not found");
	connection->the = the;
	connection->objConnection = xsThis;
	connection->objClient = xsArg(0);
}
	
void xs_gap_connection_disconnect(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void xs_gap_connection_read_rssi(xsMachine *the)
{
	uint8_t conn_id = xsmcToInteger(xsArg(0));
}

void xs_gap_connection_exchange_mtu(xsMachine *the)
{
	uint16_t conn_id = xsmcToInteger(xsArg(0));
	uint16_t mtu = xsmcToInteger(xsArg(1));
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_id);
	if (!connection) return;

}

void xs_gatt_client_discover_primary_services(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t argc = xsmcArgc;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	if (argc > 1)
		bufferToUUID(&connection->searchUUID, (uint8_t*)xsmcToArrayBuffer(xsArg(1)), xsGetArrayBufferLength(xsArg(1)));
	else
		connection->searchUUID.uuid = 0;
	connection->obj = xsThis;
	
	sd_ble_gattc_primary_services_discover(conn_handle, 1, (argc > 1 ? &connection->searchUUID : NULL));
}

void xs_gatt_service_discover_characteristics(xsMachine *the)
{
	uint16_t argc = xsmcArgc;
	uint8_t conn_handle = xsmcToInteger(xsArg(0));

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	connection->handle_range.start_handle = xsmcToInteger(xsArg(1));
	connection->handle_range.end_handle = xsmcToInteger(xsArg(2));
	if (argc > 3) {
		bufferToUUID(&connection->searchUUID, (uint8_t*)xsmcToArrayBuffer(xsArg(3)), xsGetArrayBufferLength(xsArg(3)));
	}
	else
		connection->searchUUID.uuid = 0;
	connection->obj = xsThis;
		
	sd_ble_gattc_characteristics_discover(conn_handle, &connection->handle_range);
}

void xs_gatt_characteristic_discover_all_characteristic_descriptors(xsMachine *the)
{
	uint8_t conn_id = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
}

void xs_gatt_characteristic_read_value(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
	ret_code_t err_code;
#if 0
	uint16_t auth = 0;
	uint16_t argc = xsmcArgc;
	if (argc > 2)
		auth = xsmcToInteger(xsArg(2));
#endif
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	sd_ble_gattc_read(connection->conn_handle, handle, 0);
}

void xs_gatt_characteristic_enable_notifications(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
    uint8_t data[2] = {0x01, 0x00};
	ble_gattc_write_params_t write_params;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	c_memset(&write_params, 0, sizeof(write_params));
	write_params.write_op = BLE_GATT_OP_WRITE_CMD;
	write_params.handle = characteristic + 1;
	write_params.offset = 0;
	write_params.len = 2;
	write_params.p_value = data;
	
	sd_ble_gattc_write(connection->conn_handle, &write_params);
}

