Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	ble_gap_evt_auth_status_t const * p_evt_auth_status = (ble_gap_evt_auth_status_t const *)message;
	if (BLE_GAP_SEC_STATUS_SUCCESS == p_evt_auth_status->auth_status) {
		xsBeginHost(gBLE->the);
		xsCall1(gBLE->obj, xsID_callback, xsString("onAuthenticated"));
		xsEndHost(gBLE->the);
	}
}

void gattcServiceDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
modLog("in gattcServiceDiscoveryEvent");
	ble_gattc_evt_t const *gattc_evt = (ble_gattc_evt_t const *)message;
    ble_gattc_evt_prim_srvc_disc_rsp_t const *prim_srvc_disc_rsp = &gattc_evt->params.prim_srvc_disc_rsp;
    
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(gattc_evt->conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	if (BLE_GATT_STATUS_SUCCESS != gattc_evt->gatt_status) {
modLog("failure 1 onService");
		xsCall1(connection->objClient, xsID_callback, xsString("onService"));
		goto bail;
	}
	else {
		uint16_t end_handle;
		ret_code_t err_code;
		xsmcVars(2);
		for (uint16_t i = 0; i < prim_srvc_disc_rsp->count; ++i) {
			uint8_t buffer[UUID_LEN_128];
			uint16_t length;
			ble_gattc_service_t const *service = &prim_srvc_disc_rsp->services[i];
modLogInt(service->uuid.uuid);
			uuidToBuffer(buffer, (ble_uuid_t *)&service->uuid, &length);
			if (0 != length) {
				xsVar(0) = xsmcNewObject();
				xsmcSetArrayBuffer(xsVar(1), buffer, length);
				xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
				xsmcSetInteger(xsVar(1), service->handle_range.start_handle);
				xsmcSet(xsVar(0), xsID_start, xsVar(1));
				xsmcSetInteger(xsVar(1), service->handle_range.end_handle);
				xsmcSet(xsVar(0), xsID_end, xsVar(1));
				xsCall2(connection->objClient, xsID_callback, xsString("onService"), xsVar(0));
				end_handle = service->handle_range.end_handle;
	modLog("onService, end_handle =");
	modLogInt(end_handle);
			}
		}
		if (connection->searchUUID.uuid == 0)
			err_code = sd_ble_gattc_primary_services_discover(connection->conn_handle, end_handle + 1, NULL);
		else
			err_code = sd_ble_gattc_primary_services_discover(connection->conn_handle, end_handle + 1, &connection->searchUUID);
		if (NRF_SUCCESS != err_code) {
modLog("failure 2 onService");
			xsCall1(connection->objClient, xsID_callback, xsString("onService"));
		}
	}
bail:
modLog("out gattcServiceDiscoveryEvent");
	xsEndHost(gBLE->the);
}

void gattcCharacteristicDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_t const *gattc_evt = (ble_gattc_evt_t const *)message;
	ble_gattc_evt_char_disc_rsp_t const *char_disc_rsp = &gattc_evt->params.char_disc_rsp;
    
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(gattc_evt->conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	if (BLE_GATT_STATUS_SUCCESS != gattc_evt->gatt_status) {
		xsCall1(connection->obj, xsID_callback, xsString("onCharacteristic"));
		goto bail;
	}
	else {
		uint16_t handle_value = connection->handle_range.start_handle;
		ret_code_t err_code;
		xsmcVars(2);
		
		for (uint16_t i = 0; i < char_disc_rsp->count; ++i) {
			uint8_t buffer[UUID_LEN_128];
			uint16_t length;
			ble_gattc_char_t const *characteristic = &char_disc_rsp->chars[i];
			
			uuidToBuffer(buffer, (ble_uuid_t *)&characteristic->uuid, &length);
			if ((connection->searchUUID.uuid != 0) && BLE_UUID_NEQ(&connection->searchUUID, &characteristic->uuid))
				continue;
				
			int index = modBLEConnectionSaveAttHandle(connection, (ble_uuid_t *)&characteristic->uuid, characteristic->handle_value);
			xsVar(0) = xsmcNewObject();
			xsmcSetArrayBuffer(xsVar(1), buffer, length);
			xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
			xsmcSetInteger(xsVar(1), characteristic->handle_value);
			xsmcSet(xsVar(0), xsID_handle, xsVar(1));

			uint8_t properties = 0;
			if (characteristic->char_props.read)
				properties |= GATT_CHAR_PROP_BIT_READ;
			if (characteristic->char_props.write_wo_resp)
				properties |= GATT_CHAR_PROP_BIT_WRITE_NR;
			if (characteristic->char_props.write)
				properties |= GATT_CHAR_PROP_BIT_WRITE;
			if (characteristic->char_props.notify)
				properties |= GATT_CHAR_PROP_BIT_NOTIFY;
			if (characteristic->char_props.indicate)
				properties |= GATT_CHAR_PROP_BIT_INDICATE;
			xsmcSetInteger(xsVar(1), properties);
			xsmcSet(xsVar(0), xsID_properties, xsVar(1));
			
			if (-1 != index) {
				xsmcSetString(xsVar(1), (char*)char_names[index].name);
				xsmcSet(xsVar(0), xsID_name, xsVar(1));
				xsmcSetString(xsVar(1), (char*)char_names[index].type);
				xsmcSet(xsVar(0), xsID_type, xsVar(1));
			}
			xsCall2(connection->obj, xsID_callback, xsString("onCharacteristic"), xsVar(0));
			
			if (BLE_UUID_EQ(&characteristic->uuid, &connection->searchUUID)) {
				xsCall1(connection->obj, xsID_callback, xsString("onCharacteristic"));
				goto bail;
			}
			handle_value = characteristic->handle_value;
		}
		connection->handle_range.start_handle = handle_value + 1;
		err_code = sd_ble_gattc_characteristics_discover(connection->conn_handle, &connection->handle_range);
		if (NRF_SUCCESS != err_code)
			xsCall1(connection->obj, xsID_callback, xsString("onCharacteristic"));
	}
bail:
	xsEndHost(gBLE->the);
}

void gattcCharacteristicReadEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_t const *gattc_evt = (ble_gattc_evt_t const *)message;
	ble_gattc_evt_read_rsp_t const *read_rsp = &gattc_evt->params.read_rsp;
	uint8_t *data = (uint8_t*)refcon;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(gattc_evt->conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	if (BLE_GATT_STATUS_SUCCESS != gattc_evt->gatt_status) {
		goto bail;
	}
	
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), (void*)data, read_rsp->len);
	xsmcSet(xsVar(0), xsID_value, xsVar(1));
	xsmcSetInteger(xsVar(1), read_rsp->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	xsCall2(connection->objClient, xsID_callback, xsString("onCharacteristicValue"), xsVar(0));
	
